# 3. <a id='intro'>[Pandas](https://www.freecodecamp.org/news/how-to-analyze-data-with-python-pandas/)</a>

- <a href='#def'>3.1. Definition</a>  
- <a href='#series'>3.2. Pandas Series</a>
     - <a href='#3.2.1'>3.2.1. From `lists` to `Series`</a>
     - <a href='#3.2.2'> 3.2.2. From `NumPy array` to `Series`</a>
     - <a href='#3.2.3'> 3.2.3. From `Dictionary` to `Series`</a>
     - <a href='#3.2.4'> 3.2.4. `Series` vs `NumPy`</a>
     - <a href='#3.2.5'> 3.2.5 Indexing</a></a>
- <a href='#3.3'>3.3 DataFrame</a>
     - <a href='#3.3.1'>3.3.1 DataFrame Generation</a>
     - <a href='#3.3.2'>3.3.2 Indexing</a>
     - <a href='#3.3.3'>3.3.3 General Methods</a>
     - <a href='#3.3.4'>3.3.4 Importing Data</a>
     - <a href='#3.3.5'>3.3.5 Filtering data</a> 
     - <a href='#3.3.6'>3.3.6 Dealing with nulls</a>  
     - <a href='#3.3.7'>3.3.7 Duplicates</a>  
     - <a href='#3.3.8'>3.3.8 Groupby</a>  
     - <a href='#3.3.9'>3.3.9 Reshape</a>  
     - <a href='#3.3.10'>3.3.10 Merge</a>  
     
- <a href='#3.4'>3.4 References</a>

## 3.1. <a id='def'>Definition</a>

Pandas is a Python library used for working with data sets. This is the "must-learn" library for Data I/O, cleansing, transforming and aggregation. It is an external library so we need to import it in your applications by adding the `import` keyword

In [1]:
import pandas as pd
import numpy as np

Now the `Pandas` package can be referred to as `pd` instead of pandas.

## 3.2. <a id='series'>[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)</a>

The first pandas data strucuture is a Series. A Series is a one-dimensional array that can hold any datatype, similar to a ndarray. However, a Series has a **index** that gives a a label to each entry. An index generally is used to label the data.
Typically a Series contains information about **one feature** of the data. <br>

A `Pandas Series` is a one-dimensional array of indexed data. It can be created from a list or array as follows:

### 3.2.1. <a id='3.2.1'>From `lists` to `Series`<a>

In [2]:
list_1 = [0.25, 0.5, 0.75, 1.0]
list_1

[0.25, 0.5, 0.75, 1.0]

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data_2 = pd.Series( list_1 )
data_2

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [5]:
type(data)

pandas.core.series.Series

In [6]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
print( data )

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

### 3.2.2. <a id='3.2.2'> From `NumPy array` to `Series` <a>

In [8]:
vector_1 = np.array( [ 10, 20, 1, 2, 
                    3, 4, 5, 6, 7 ] )
vector_1

array([10, 20,  1,  2,  3,  4,  5,  6,  7])

In [9]:
pd.Series(vector_1)

0    10
1    20
2     1
3     2
4     3
5     4
6     5
7     6
8     7
dtype: int64

In [10]:
array = np.array( [ 10, 20, 1, 2, 
                    3, 4, 5, 6, 7 ] )
series1 = pd.Series( array )
series1

0    10
1    20
2     1
3     2
4     3
5     4
6     5
7     6
8     7
dtype: int64

### 3.2.3.  <a id='3.2.3'> From `Dictionary` to `Series` </a>

In [11]:
population_dict = { 'California' : 38332521,
                    'Texas'      : 26448193,
                    'New York'   : 19651127,
                    'Florida'    : 19552860,
                    'Illinois'   : 12882135 }

In [12]:
pd.Series( population_dict )

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [13]:
population = pd.Series( population_dict )
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

As we see in the output, the `Series` wraps both a sequence of values and a sequence of indices, which we can access with the `values` and `index` attributes. The values are simply a familiar NumPy array:

In [14]:
population.values

array([38332521, 26448193, 19651127, 19552860, 12882135])

In [15]:
population.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

### 3.2.4.  <a id='3.2.4'> `Series` vs `NumPy`</a>

The essential difference is the presence of the index: while the `Numpy Array` has an implicitly defined integer index used to access the values, the `Pandas Series` has an explicitly defined index associated with the values. <br>

The `index` do not need to be an integer. we can use `strings`.

In [16]:
claudia = np.arange(5, 21, 2)
claudia

array([ 5,  7,  9, 11, 13, 15, 17, 19])

In [17]:
import numpy as np
math = pd.Series( np.arange(5.,21.,3.) , ['joyce','jeremy','ivan','marcy','daniel','franclin'])
math

joyce        5.0
jeremy       8.0
ivan        11.0
marcy       14.0
daniel      17.0
franclin    20.0
dtype: float64

In [18]:
info = np.arange(5 , 15 ,3.)
index_info =  ['joyce','jeremy','ivan','marcy']

In [19]:
math_2 = pd.Series(  info , index_info, dtype = int,  name = "Daniel")
math_2

joyce      5
jeremy     8
ivan      11
marcy     14
Name: Daniel, dtype: int64

Excersice: <br>
Get the `values` and `index` from `math` `Series`.

### 3.2.5.  <a id='3.2.5'> Indexing</a>


Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame. Indexing could mean selecting all the rows and some of the columns, some of the rows and all of the columns, or some of each of the rows and columns. Indexing can also be known as Subset Selection.

In [20]:
print( data )
print( population )

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [21]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [22]:
print( data[ 1:4 ] )

1    0.50
2    0.75
3    1.00
dtype: float64

In [23]:
print( population[ 'California':'Texas' ] )

California    38332521
Texas         26448193
dtype: int64

| Method 	| Definition 	|
| --- 	| --- 	|
| loc() 	| Gets rows (and/or columns) with particular labels.<br> Accept `Boolean` for indexing. |
| iloc() 	| gets rows (and/or columns) at integer locations. <br> Do not accept `Boolean` for indexing.|

Get the value of New York.

In [24]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [25]:
population.loc[ "New York" ]

np.int64(19651127)

In [26]:
population.iloc[ 1: 3]

Texas       26448193
New York    19651127
dtype: int64

In [27]:
print( population.loc[ "New York" ] == population.iloc[ 2 ] )

True

Replicate this excersice for `data` Series.

## 3.3.  <a id='3.3'> [DataFrame](https://www.w3schools.com/python/pandas/pandas_dataframes.asp)</a>


A DataFrame is a collection of multiple Series. It can be thought of as a 2-dimensional array, where each row is a separate datapoint and each column is a feature of the data. The rows are labeled with an index(as in a Series) and the columns are lebeled in the attribute columns.<br>
There are many different ways to initialize a DataFrame. <br>

### 3.3.1. <a id='3.3.1'> DataFrame Generation</a>
#### From `lists` and `dict` to `DataFrame`

In [28]:
# Grades
students = [ "Alejandro", "Pedro", "Ramiro", "Axel", "Juan" ]
math     = [ 15, 16, 10, 12, 13 ]
english  = [ 13, 9, 16, 14, 17 ]
art      = [ 12, 16, 15, 19, 10 ]

# Dictionary
grades_A = {'Students':students, 'Math':math, 'English':english, 'Art':art}

In [29]:
grades_A

{'Students': ['Alejandro', 'Pedro', 'Ramiro', 'Axel', 'Juan'],
 'Math': [15, 16, 10, 12, 13],
 'English': [13, 9, 16, 14, 17],
 'Art': [12, 16, 15, 19, 10]}

In [30]:
import pandas as pd

In [31]:
pd.DataFrame(grades_A)

    Students  Math  English  Art
0  Alejandro    15       13   12
1      Pedro    16        9   16
2     Ramiro    10       16   15
3       Axel    12       14   19
4       Juan    13       17   10

In [32]:
pd.DataFrame( grades_A )

    Students  Math  English  Art
0  Alejandro    15       13   12
1      Pedro    16        9   16
2     Ramiro    10       16   15
3       Axel    12       14   19
4       Juan    13       17   10

In [33]:
gradesA1 = pd.DataFrame( grades_A )
gradesA1

    Students  Math  English  Art
0  Alejandro    15       13   12
1      Pedro    16        9   16
2     Ramiro    10       16   15
3       Axel    12       14   19
4       Juan    13       17   10

In [34]:
# grades_A["dataframe_stephy"] = gradesA1

In [35]:
# grades_A.pop("dataframe_stephy")

In [36]:
# gradesA1

#### From `lists` and `NumPy` to `DataFrame`

In [37]:
matrix_1 = np.array([ [ 1, 2, 3 ], [ 4, 5, 6 ], [ 7, 8, 9 ] ] )
matrix_1

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
col_names = [ 'a', 'b', 'c' ]

In [39]:
#pd.DataFrame()

In [40]:
data2 = pd.DataFrame( data = matrix_1, columns = col_names )
data2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### 3.3.2. <a id='3.3.2'> Indexing</a>

We can use the same methods as `Series`: `iloc` and `loc`. We can select columns and rows.

In [41]:
# Grades
students = [ "Gissela", "Daniel", "Andres", "Sandra", "Rosalyn" ]
math     = [ 16, 14, 17, 17, 17 ]
english  = [ 16, 17, 19, 18, 15 ]
art      = [ 11, 17, 13, 14, 17 ]

# Dictionary
diplomado = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA1 = pd.DataFrame( data = diplomado )
gradesA1

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [42]:
gradesA1.loc[ 1:1, : ]

  Students  Math  English  Art
1   Daniel    14       17   17

In [43]:
gradesA1.loc[ [1], : ]

  Students  Math  English  Art
1   Daniel    14       17   17

In [44]:
gradesA1.loc[ : , ["Students", "Art"] ]

  Students  Art
0  Gissela   11
1   Daniel   17
2   Andres   13
3   Sandra   14
4  Rosalyn   17

In [45]:
gradesA1.loc[ 0:3 , ["Students" , "Math"] ]

  Students  Math
0  Gissela    16
1   Daniel    14
2   Andres    17
3   Sandra    17

In [46]:
gradesA1

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [47]:
gradesA1.iloc[ 0:3 , 0:2]

  Students  Math
0  Gissela    16
1   Daniel    14
2   Andres    17

In [48]:
gradesA1.iloc[ 2:5, [0, 3] ]

  Students  Art
2   Andres   13
3   Sandra   14
4  Rosalyn   17

In [49]:
gradesA1.iloc[ 0:2, 0:3 ]

  Students  Math  English
0  Gissela    16       16
1   Daniel    14       17

In [50]:
gradesA1

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [51]:
gradesA1.iloc[ [0, 2, 4] , : ]

  Students  Math  English  Art
0  Gissela    16       16   11
2   Andres    17       19   13
4  Rosalyn    17       15   17

### 3.3.3. <a id='3.3.3'> General Methods</a>

|Method|Description|
|------|-----------|
|columns()|Get the name of the columns.|
|sort_values()|Sort by the values along either axis.|
|sort_index()|Sort by the index.|
|head()|Show the first N observations.|
|drop( )| Remove the entries  <br>  with the specified label or labels|
|append( )| Concatenate two or more Series.|
|drop_duplicates( )| Remove duplicate values|
|dropna( ) |Drop null entries|
|fillna( ) |Replace null entries <br> with a specified value or strategy|
|reset_index( )| Index as column.|
|sample( ) |Draw a random entry|
|shift( ) |Shift the index|
|unique( ) |Return unique values|

In [52]:
deps = {
        'dep' : ['Lima', 'Piura', 'Tumbes', 'Cuzco', 'Ica', 'Puno'],
        'year': [ 2000, 2001, 2002, 2001, 2002, 2003 ],
        'pop' : [ 1.5, 1.7, 3.6, 2.4, 2.9, 3.2 ] 
        }
dep1 = pd.DataFrame( deps )
dep1

      dep  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [53]:
dep1.sort_values( ["dep"], ascending=True , inplace=True)

In [54]:
dep1

      dep  year  pop
3   Cuzco  2001  2.4
4     Ica  2002  2.9
0    Lima  2000  1.5
1   Piura  2001  1.7
5    Puno  2003  3.2
2  Tumbes  2002  3.6

In [55]:
dep1

      dep  year  pop
3   Cuzco  2001  2.4
4     Ica  2002  2.9
0    Lima  2000  1.5
1   Piura  2001  1.7
5    Puno  2003  3.2
2  Tumbes  2002  3.6

In [56]:
# Not `inplace` argument
dep1_sort = dep1.sort_values(['year','pop'], ascending = False)
dep1.sort_values(['year','pop'], ascending = False)

      dep  year  pop
5    Puno  2003  3.2
2  Tumbes  2002  3.6
4     Ica  2002  2.9
3   Cuzco  2001  2.4
1   Piura  2001  1.7
0    Lima  2000  1.5

In [57]:
# Not `inplace` argument
dep1_sort = dep1.sort_values(['year','pop'], ascending = False)
dep1.sort_values(['year','pop'], ascending = False)

      dep  year  pop
5    Puno  2003  3.2
2  Tumbes  2002  3.6
4     Ica  2002  2.9
3   Cuzco  2001  2.4
1   Piura  2001  1.7
0    Lima  2000  1.5

In [58]:
dep1

      dep  year  pop
3   Cuzco  2001  2.4
4     Ica  2002  2.9
0    Lima  2000  1.5
1   Piura  2001  1.7
5    Puno  2003  3.2
2  Tumbes  2002  3.6

In [59]:
dep1

      dep  year  pop
3   Cuzco  2001  2.4
4     Ica  2002  2.9
0    Lima  2000  1.5
1   Piura  2001  1.7
5    Puno  2003  3.2
2  Tumbes  2002  3.6

In [60]:
# Not `inplace` argument
dep1.sort_values(['year','pop'],ascending = False , inplace = True )
dep1

      dep  year  pop
5    Puno  2003  3.2
2  Tumbes  2002  3.6
4     Ica  2002  2.9
3   Cuzco  2001  2.4
1   Piura  2001  1.7
0    Lima  2000  1.5

In [61]:
# Back to the original
dep1.sort_index( inplace = True )
dep1

      dep  year  pop
0    Lima  2000  1.5
1   Piura  2001  1.7
2  Tumbes  2002  3.6
3   Cuzco  2001  2.4
4     Ica  2002  2.9
5    Puno  2003  3.2

In [62]:
# Grades
students = [ "Gissela", "Daniel", "Andres", "Sandra", "Rosalyn" ]
math     = [ 16, 14, 17, 17, 17 ]
english  = [ 16, 17, 19, 18, 15 ]
art      = [ 11, 17, 13, 14, 17 ]

# Dictionary
diplomado = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA1 = pd.DataFrame( data = diplomado )
gradesA1

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [63]:
gradesA1[ "avg" ] = (gradesA1[ 'Math' ] + gradesA1[ 'English' ] + gradesA1[ 'Art' ] ) / 3
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [64]:
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [65]:
# Operations with DataFrame, new column
gradesA1[ 'avg' ] = ( gradesA1[ 'Math' ] + gradesA1[ 'English' ] + gradesA1[ 'Art' ] ) / 3
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [66]:
# Mean Math & English
# gradesA1.iloc[:, 2:4].mean( axis = 1)

In [67]:
# # Mean Math adn Art
# gradesA1.iloc[:, [1, 3]].mean( axis = 1)

In [68]:
# head
gradesA1.head( 4 )

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333

In [69]:
gradesA1.head(3)

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333

In [70]:
gradesA1.drop( ["avg"], axis=1 )

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [71]:
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [72]:
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [73]:
gradesA1.drop( [ 'avg' , 'Art' ], axis = 1 ).drop([3], axis = 0)

  Students  Math  English
0  Gissela    16       16
1   Daniel    14       17
2   Andres    17       19
4  Rosalyn    17       15

In [74]:
# drop column
# Always use copy when you want to modify your DataFrame
gradesA1_1 = gradesA1.drop( [ 'avg' , 'Art' ], axis = 1 )
gradesA1_1

  Students  Math  English
0  Gissela    16       16
1   Daniel    14       17
2   Andres    17       19
3   Sandra    17       18
4  Rosalyn    17       15

In [75]:
# gradesA1_1 = gradesA1.drop( [ 'avg' , 'Art' ], axis = 1 )
# gradesA1_1

In [76]:
# add new data gradesA2
students = [ "Rebeca", "Xavi", "Cristiano", "Ronaldo", "Leo" ]
math     = [ 15, 18, 14, 7, 10 ]
english  = [ 18, 9, 11, 12, 20 ]
art      = [ 10, 16, 20, 19, 5 ]

# Dictionary
grades_A2 = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA2 = pd.DataFrame( grades_A2 )
print( gradesA2 , "\n")

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

In [77]:
gradesA2

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

In [78]:
gradesA1

  Students  Math  English  Art        avg
0  Gissela    16       16   11  14.333333
1   Daniel    14       17   17  16.000000
2   Andres    17       19   13  16.333333
3   Sandra    17       18   14  16.333333
4  Rosalyn    17       15   17  16.333333

In [79]:
# En pandas >= 2.0, DataFrame.append fue removido.
# Usa pd.concat para unir dataframes.
grades_total = pd.concat([gradesA1, gradesA2], ignore_index=True)
grades_total

    Students  Math  English  Art        avg
0    Gissela    16       16   11  14.333333
1     Daniel    14       17   17  16.000000
2     Andres    17       19   13  16.333333
3     Sandra    17       18   14  16.333333
4    Rosalyn    17       15   17  16.333333
5     Rebeca    15       18   10        NaN
6       Xavi    18        9   16        NaN
7  Cristiano    14       11   20        NaN
8    Ronaldo     7       12   19        NaN
9        Leo    10       20    5        NaN

In [80]:
gradesA2

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

In [81]:
grades_total = pd.concat([gradesA1, gradesA2], ignore_index=True)
grades_total

    Students  Math  English  Art        avg
0    Gissela    16       16   11  14.333333
1     Daniel    14       17   17  16.000000
2     Andres    17       19   13  16.333333
3     Sandra    17       18   14  16.333333
4    Rosalyn    17       15   17  16.333333
5     Rebeca    15       18   10        NaN
6       Xavi    18        9   16        NaN
7  Cristiano    14       11   20        NaN
8    Ronaldo     7       12   19        NaN
9        Leo    10       20    5        NaN

In [82]:
grades_total.iloc[ [9], :]

  Students  Math  English  Art  avg
9      Leo    10       20    5  NaN

In [83]:
grades_total = pd.concat([gradesA1_1, gradesA2], ignore_index=True).copy()
print(grades_total)

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [84]:
cars = pd.DataFrame({
            'brands'    : [ 'hyundai', 'hyundai', 'kia', 'kia', 'kia' ] ,
            'model'     : [ 'sedan', 'sedan', 'sedan', 'truck', 'truck' ] ,
            'passengers': [ 4, 4, 5, 6, 8 ]
            })
cars

    brands  model  passengers
0  hyundai  sedan           4
1  hyundai  sedan           4
2      kia  sedan           5
3      kia  truck           6
4      kia  truck           8

In [85]:
cars.drop_duplicates(subset= ["brands"] )

    brands  model  passengers
0  hyundai  sedan           4
2      kia  sedan           5

In [86]:
cars_subset = cars.drop_duplicates(subset = [ 'brands' ], keep= "last")
cars_subset

    brands  model  passengers
1  hyundai  sedan           4
4      kia  truck           8

In [87]:
cars.drop_duplicates(subset = ['brands','model','passengers' ], keep = 'first')

    brands  model  passengers
0  hyundai  sedan           4
2      kia  sedan           5
3      kia  truck           6
4      kia  truck           8

In [88]:
grades_total

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [89]:
# dropna
print( grades_total , "\n" )

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [90]:
grades_total.iloc[0:6, :]

  Students  Math  English   Art
0  Gissela    16       16   NaN
1   Daniel    14       17   NaN
2   Andres    17       19   NaN
3   Sandra    17       18   NaN
4  Rosalyn    17       15   NaN
5   Rebeca    15       18  10.0

In [91]:
grades_total

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [92]:
grades_total.dropna(axis=0)

    Students  Math  English   Art
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [93]:
grades_total.dropna(axis=1)

    Students  Math  English
0    Gissela    16       16
1     Daniel    14       17
2     Andres    17       19
3     Sandra    17       18
4    Rosalyn    17       15
5     Rebeca    15       18
6       Xavi    18        9
7  Cristiano    14       11
8    Ronaldo     7       12
9        Leo    10       20

In [94]:
grades_total

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [95]:
grades_total_NA_zero =  grades_total.fillna(0)
grades_total_NA_zero

    Students  Math  English   Art
0    Gissela    16       16   0.0
1     Daniel    14       17   0.0
2     Andres    17       19   0.0
3     Sandra    17       18   0.0
4    Rosalyn    17       15   0.0
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [96]:
grades_total

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [97]:
grades_total_NA = grades_total.dropna()
grades_total_NA

    Students  Math  English   Art
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [98]:
print( grades_total_NA )

    Students  Math  English   Art
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [99]:
# fillna
print( grades_total , "\n" )
grades_total_fill_na = grades_total.fillna( "Na value" )
print( grades_total_fill_na )

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

    Students  Math  English       Art
0    Gissela    16       16  Na value
1     Daniel    14       17  Na value
2     Andres    17       19  Na value
3     Sandra    17       18  Na value
4    Rosalyn    17       15  Na value
5     Rebeca    15       18      10.0
6       Xavi    18        9      16.0
7  Cristiano    14       11      20.0
8    Ronaldo     7       12      19.0
9        Leo    10       20       5.0

In [100]:
# reset_index()
print( grades_total , "\n" )

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [101]:
print( grades_total.reset_index() , "\n" )

   index   Students  Math  English   Art
0      0    Gissela    16       16   NaN
1      1     Daniel    14       17   NaN
2      2     Andres    17       19   NaN
3      3     Sandra    17       18   NaN
4      4    Rosalyn    17       15   NaN
5      5     Rebeca    15       18  10.0
6      6       Xavi    18        9  16.0
7      7  Cristiano    14       11  20.0
8      8    Ronaldo     7       12  19.0
9      9        Leo    10       20   5.0

In [102]:
print( grades_total.reset_index( drop = True ) )

    Students  Math  English   Art
0    Gissela    16       16   NaN
1     Daniel    14       17   NaN
2     Andres    17       19   NaN
3     Sandra    17       18   NaN
4    Rosalyn    17       15   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
8    Ronaldo     7       12  19.0
9        Leo    10       20   5.0

In [103]:
print( grades_total.sample( n = 5) , "\n" )

    Students  Math  English   Art
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0
5     Rebeca    15       18  10.0
0    Gissela    16       16   NaN
2     Andres    17       19   NaN

In [104]:
print( grades_total.sample( frac = 0.5) , "\n" )

    Students  Math  English   Art
1     Daniel    14       17   NaN
3     Sandra    17       18   NaN
5     Rebeca    15       18  10.0
6       Xavi    18        9  16.0
7  Cristiano    14       11  20.0

In [105]:
# # reset_index
# print( grades_total, "\n" )
# print( grades_total.reset_index( drop = True ).shift( 1  ), "\n" )

In [106]:
# # unique
# cars['brands'].unique()

### 3.3.4. <a id='3.3.4'> Importing Data</a>

|Method|Description|
|------|-----------|
|read_excel( )|Read a excel file and convert to a DataFrame.|
|to_csv( )| Write the index and entries to a CSV file|
|read_csv( )| Read a csv and convert into a DataFrame|
|to_json( )| Convert the object to a JSON string|
|to_pickle( )| Serialize the object and store it in an external file|
|to_sql( )| Write the object data to an open SQL database|
|read_html( )| Read a table in an html page and convert to a DataFrame|
|read_spss( )| Read a spss file and convert to a DataFrame.|

Load csv file as Pandas dataframe

In [107]:

import numpy as np
import pandas as pd
from datetime import datetime
import os
from pathlib import Path

In [108]:
path = Path(r"../_data") / "LendingClub.csv"
raw_data_all = pd.read_csv(path, low_memory=False)
raw_data_all.head()

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
0,NaN,NaN,5000.0,5000.0,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2500.0,2500.0,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,2400.0,2400.0,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,10000.0,10000.0,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,3000.0,3000.0,3000.0,60 months,12.69%,67.79,B,B5,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [109]:
raw_data_all.columns.tolist()

['id',
 'member_id',
 'loan_amnt',
 'funded_amnt',
 'funded_amnt_inv',
 'term',
 'int_rate',
 'installment',
 'grade',
 'sub_grade',
 'emp_title',
 'emp_length',
 'home_ownership',
 'annual_inc',
 'verification_status',
 'issue_d',
 'loan_status',
 'pymnt_plan',
 'url',
 'desc',
 'purpose',
 'title',
 'zip_code',
 'addr_state',
 'dti',
 'delinq_2yrs',
 'earliest_cr_line',
 'inq_last_6mths',
 'mths_since_last_delinq',
 'mths_since_last_record',
 'open_acc',
 'pub_rec',
 'revol_bal',
 'revol_util',
 'total_acc',
 'initial_list_status',
 'out_prncp',
 'out_prncp_inv',
 'total_pymnt',
 'total_pymnt_inv',
 'total_rec_prncp',
 'total_rec_int',
 'total_rec_late_fee',
 'recoveries',
 'collection_recovery_fee',
 'last_pymnt_d',
 'last_pymnt_amnt',
 'next_pymnt_d',
 'last_credit_pull_d',
 'collections_12_mths_ex_med',
 'mths_since_last_major_derog',
 'policy_code',
 'application_type',
 'annual_inc_joint',
 'dti_joint',
 'verification_status_joint',
 'acc_now_delinq',
 'tot_coll_amt',
 'tot_cur_bal',
 'open_acc_6m',
 'open_act_il',
 'open_il_12m',
 'open_il_24m',
 'mths_since_rcnt_il',
 'total_bal_il',
 'il_util',
 'open_rv_12m',
 'open_rv_24m',
 'max_bal_bc',
 'all_util',
 'total_rev_hi_lim',
 'inq_fi',
 'total_cu_tl',
 'inq_last_12m',
 'acc_open_past_24mths',
 'avg_cur_bal',
 'bc_open_to_buy',
 'bc_util',
 'chargeoff_within_12_mths',
 'delinq_amnt',
 'mo_sin_old_il_acct',
 'mo_sin_old_rev_tl_op',
 'mo_sin_rcnt_rev_tl_op',
 'mo_sin_rcnt_tl',
 'mort_acc',
 'mths_since_recent_bc',
 'mths_since_recent_bc_dlq',
 'mths_since_recent_inq',
 'mths_since_recent_revol_delinq',
 'num_accts_ever_120_pd',
 'num_actv_bc_tl',
 'num_actv_rev_tl',
 'num_bc_sats',
 'num_bc_tl',
 'num_il_tl',
 'num_op_rev_tl',
 'num_rev_accts',
 'num_rev_tl_bal_gt_0',
 'num_sats',
 'num_tl_120dpd_2m',
 'num_tl_30dpd',
 'num_tl_90g_dpd_24m',
 'num_tl_op_past_12m',
 'pct_tl_nvr_dlq',
 'percent_bc_gt_75',
 'pub_rec_bankruptcies',
 'tax_liens',
 'tot_hi_cred_lim',
 'total_bal_ex_mort',
 'total_bc_limit',
 'total_il_high_credit_limit',
 'revol_bal_joint',
 'sec_app_earliest_cr_line',
 'sec_app_inq_last_6mths',
 'sec_app_mort_acc',
 'sec_app_open_acc',
 'sec_app_revol_util',
 'sec_app_open_act_il',
 'sec_app_num_rev_accts',
 'sec_app_chargeoff_within_12_mths',
 'sec_app_collections_12_mths_ex_med',
 'sec_app_mths_since_last_major_derog',
 'hardship_flag',
 'hardship_type',
 'hardship_reason',
 'hardship_status',
 'deferral_term',
 'hardship_amount',
 'hardship_start_date',
 'hardship_end_date',
 'payment_plan_start_date',
 'hardship_length',
 'hardship_dpd',
 'hardship_loan_status',
 'orig_projected_additional_accrued_interest',
 'hardship_payoff_balance_amount',
 'hardship_last_payment_amount',
 'disbursement_method',
 'debt_settlement_flag',
 'debt_settlement_flag_date',
 'settlement_status',
 'settlement_date',
 'settlement_amount',
 'settlement_percentage',
 'settlement_term']

Understanding Pandas dataframes through the LendingClub dataset
As we'll be working with Pandas dataframes throughout the lecture, let's take some time to understand the basic concepts.

Select a few important columns to work with
As there are many columns we'll just select a few more important ones to keep.

We first create a list of column names to keep.
The right hand side of the following command creates a new dataframe by selecting a list of columns from an existing dataframe. To reuse the original variable name, we'll just assign the newly created dataframe to the original 'raw_data' variable.

In [110]:
# List of columns to keep
cols = ['loan_amnt', 'term', 'int_rate', 'funded_amnt', 'grade', 'annual_inc', 'dti', 'hardship_loan_status', 'delinq_2yrs', 'last_pymnt_amnt', 'emp_length','loan_status','home_ownership','tax_liens']
# Dataframe with selected columns
raw_data = raw_data_all[cols]

In [111]:
#Let's check the top rows
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,hardship_loan_status,delinq_2yrs,last_pymnt_amnt,emp_length,loan_status,home_ownership,tax_liens
0,5000.0,36 months,10.65%,5000.0,B,24000.0,27.65,NaN,0.0,171.62,10+ years,Fully Paid,RENT,0.0
1,2500.0,60 months,15.27%,2500.0,C,30000.0,1.00,NaN,0.0,119.66,< 1 year,Charged Off,RENT,0.0
2,2400.0,36 months,15.96%,2400.0,C,12252.0,8.72,NaN,0.0,649.91,10+ years,Fully Paid,RENT,0.0
3,10000.0,36 months,13.49%,10000.0,C,49200.0,20.00,NaN,0.0,357.48,10+ years,Fully Paid,RENT,0.0
4,3000.0,60 months,12.69%,3000.0,B,80000.0,17.94,NaN,0.0,67.30,1 year,Fully Paid,RENT,0.0

What is the type of the object created in this way?

Let's select two columns and see what we get

In [112]:
type(raw_data[['loan_amnt', 'term']])

pandas.core.frame.DataFrame

In [113]:
raw_data[['loan_amnt', 'term']].head()

   loan_amnt        term
0     5000.0   36 months
1     2500.0   60 months
2     2400.0   36 months
3    10000.0   36 months
4     3000.0   60 months

Get an overview of the variables
We can get the type info for all variables at once to get an overview in a compact format

In [114]:
#Check field types
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42538 entries, 0 to 42537
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   loan_amnt             42535 non-null  float64
 1   term                  42535 non-null  object
 2   int_rate              42535 non-null  object
 3   funded_amnt           42535 non-null  float64
 4   grade                 42535 non-null  object
 5   annual_inc            42531 non-null  float64
 6   dti                   42535 non-null  float64
 7   hardship_loan_status  0 non-null      float64
 8   delinq_2yrs           42506 non-null  float64
 9   last_pymnt_amnt       42535 non-null  float64
 10  emp_length            41423 non-null  object
 11  loan_status           42535 non-null  object
 12  home_ownership        42535 non-null  object
 13  tax_liens             42430 non-null  float64
dtypes: float64(8), object(6)
memory usage: 4.5+ MB

We can get an overview of the basic statistics of the numerical columns

In [115]:
raw_data.describe()

,loan_amnt,funded_amnt,annual_inc,dti,hardship_loan_status,delinq_2yrs,last_pymnt_amnt,tax_liens
count,42535.000000,42535.000000,4.253100e+04,42535.000000,0.0,42506.000000,42535.000000,42430.000000
mean,11089.722581,10821.585753,6.913656e+04,13.373043,NaN,0.152449,2613.245652,0.000024
std,7410.938391,7146.914675,6.409635e+04,6.726315,NaN,0.512406,4385.066535,0.004855
min,500.000000,500.000000,1.896000e+03,0.000000,NaN,0.000000,0.000000,0.000000
25%,5200.000000,5000.000000,4.000000e+04,8.200000,NaN,0.000000,211.050000,0.000000
50%,9700.000000,9600.000000,5.900000e+04,13.470000,NaN,0.000000,528.360000,0.000000
75%,15000.000000,15000.000000,8.250000e+04,18.680000,NaN,0.000000,3170.220000,0.000000
max,35000.000000,35000.000000,6.000000e+06,29.990000,NaN,13.000000,36115.200000,1.000000

Accessing a column's values as a Series
A Series is a one-dimensional object without a DataFrame wrapper.

A DataFrame's purpose is to store data of a table format having multiple columns and rows, i.e. two-dimensionally. While a DataFrame containing a single column is possible and sometimes appropriate, in many cases we'd be better off referencing a column not as a table but the way it really is: a series of values. For example, a Series can be indexed similar to simple Python Arrays to select elements.

There are multiple ways to extract a column's values as a Series. We show the two arguably most used ways below.
Referencing a column as a Series, by its name

In [116]:
# Select top 5 rows of column "funded_amnt"
raw_data['funded_amnt'][:5]

0     5000.0
1     2500.0
2     2400.0
3    10000.0
4     3000.0
Name: funded_amnt, dtype: float64

In [117]:
type(raw_data['funded_amnt'])

pandas.core.series.Series

In [118]:
type(raw_data[['funded_amnt']])

pandas.core.frame.DataFrame

Referencing a column as a Series, using dot notation

In [119]:
# Select top 5 rows of column "funded_amnt"
raw_data.funded_amnt[:5]

0     5000.0
1     2500.0
2     2400.0
3    10000.0
4     3000.0
Name: funded_amnt, dtype: float64

Access values by numerical indexing
There is a way to access the dataframe the way we would access elements of a matrix with numerical indices.

Note: the first index is the row index and the second index is the column index:

data.iloc[row,column]

In [120]:
raw_data.columns.tolist()

['loan_amnt',
 'term',
 'int_rate',
 'funded_amnt',
 'grade',
 'annual_inc',
 'dti',
 'hardship_loan_status',
 'delinq_2yrs',
 'last_pymnt_amnt',
 'emp_length',
 'loan_status',
 'home_ownership',
 'tax_liens']

In [121]:
# Select top 5 rows of the column with the index 3. 
#Note: indexing starts with 0, so this is the "funded_amnt" column.
raw_data.iloc[:5,3]

0     5000.0
1     2500.0
2     2400.0
3    10000.0
4     3000.0
Name: funded_amnt, dtype: float64

Let's do some calculations with the Series. Since it is numerical, we can do numerical operations e.g. calculating the mean, multiplying by 2, etc.

In [122]:
raw_data.funded_amnt.mean()

np.float64(10821.585752909368)

In [123]:
raw_data.funded_amnt[:5] * 2

0    10000.0
1     5000.0
2     4800.0
3    20000.0
4     6000.0
Name: funded_amnt, dtype: float64


Unique values and aggregations on categorical variables
First let's see the unique values. Note that the result is not a series but a numpy array.

In [124]:
raw_data.grade.unique()

array(['B', 'C', 'A', 'E', 'F', 'D', 'G', nan], dtype=object)

In [125]:
raw_data.grade.value_counts()

grade
B    12389
A    10183
C     8740
D     6016
E     3394
F     1301
G      512
Name: count, dtype: int64

Group by

In [126]:
raw_data.groupby(by='grade').agg('count')

,loan_amnt,term,int_rate,funded_amnt,annual_inc,dti,hardship_loan_status,delinq_2yrs,last_pymnt_amnt,emp_length,loan_status,home_ownership,tax_liens
grade,,,,,,,,,,,,,
A,10183,10183,10183,10183,10179,10183,0,10172,10183,9790,10183,10183,10153
B,12389,12389,12389,12389,12389,12389,0,12379,12389,12045,12389,12389,12367
C,8740,8740,8740,8740,8740,8740,0,8734,8740,8558,8740,8740,8719
D,6016,6016,6016,6016,6016,6016,0,6015,6016,5896,6016,6016,6003
E,3394,3394,3394,3394,3394,3394,0,3393,3394,3345,3394,3394,3383
F,1301,1301,1301,1301,1301,1301,0,1301,1301,1279,1301,1301,1295
G,512,512,512,512,512,512,0,512,512,510,512,512,510

Note: the function name "agg" means that we perform an operation on each group, in an aggregated way

In [127]:
raw_data.groupby(by='grade').grade.agg('count')

grade
A    10183
B    12389
C     8740
D     6016
E     3394
F     1301
G      512
Name: grade, dtype: int64

Naturally, we can apply other kinds of aggregations, like summing, averaging, we can even apply custom aggregation functions. What's more, we can apply more than one of them at the same time!

In [128]:
raw_data.groupby(by='grade').funded_amnt.agg(['min', 'max', 'sum', 'mean'])

          min      max          sum          mean
grade
A       500.0  35000.0   85295150.0   8376.229991
B       500.0  35000.0  133714950.0  10793.038179
C       500.0  35000.0   93102750.0  10652.488558
D       500.0  35000.0   70068700.0  11647.057846
E       600.0  35000.0   48061025.0  14160.584856
F      1000.0  35000.0   21511400.0  16534.511914
G       600.0  35000.0    8542175.0  16683.935547

Filtering rows with conditions
Let's see how we can filter down rows based on column values. We will select only those loans where the income of the borrower is greater than $1.000.000

In [129]:

raw_data[raw_data.annual_inc > 1000000]

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,hardship_loan_status,delinq_2yrs,last_pymnt_amnt,emp_length,loan_status,home_ownership,tax_liens
7268,12025.0,36 months,14.27%,12025.0,C,1782000.0,1.31,NaN,0.0,842.91,10+ years,Fully Paid,RENT,0.0
10650,15775.0,60 months,12.99%,15775.0,C,1250000.0,21.81,NaN,0.0,358.85,2 years,Charged Off,MORTGAGE,0.0
21477,10000.0,36 months,6.54%,10000.0,A,1200000.0,1.46,NaN,0.0,222.14,10+ years,Fully Paid,OWN,0.0
23618,1500.0,36 months,6.17%,1500.0,A,1900000.0,0.57,NaN,0.0,1197.34,5 years,Fully Paid,MORTGAGE,0.0
24233,25000.0,60 months,15.20%,25000.0,D,1200000.0,0.41,NaN,0.0,14624.78,10+ years,Fully Paid,RENT,0.0
25831,12000.0,36 months,7.51%,12000.0,A,1200000.0,9.17,NaN,0.0,407.64,1 year,Fully Paid,MORTGAGE,0.0
27633,5600.0,60 months,13.61%,5600.0,C,1176000.0,1.22,NaN,1.0,137.79,10+ years,Fully Paid,MORTGAGE,0.0
28975,4500.0,60 months,7.88%,4500.0,A,1080000.0,0.57,NaN,0.0,2269.27,8 years,Fully Paid,MORTGAGE,0.0
29708,25000.0,60 months,10.62%,15500.0,B,3900000.0,0.20,NaN,0.0,353.14,3 years,Fully Paid,MORTGAGE,0.0
30176,5000.0,36 months,12.73%,5000.0,C,6000000.0,0.01,NaN,0.0,3845.25,10+ years,Fully Paid,MORTGAGE,0.0
33501,10000.0,36 months,7.74%,10000.0,A,1200000.0,0.80,NaN,0.0,199.75,1 year,Fully Paid,MORTGAGE,0.0
34051,6400.0,36 months,7.40%,6400.0,A,1440000.0,0.00,NaN,0.0,2503.47,7 years,Fully Paid,MORTGAGE,0.0
34373,6600.0,36 months,7.74%,6600.0,A,1362000.0,0.62,NaN,0.0,5470.14,9 years,Fully Paid,MORTGAGE,0.0
39158,8450.0,36 months,12.29%,8450.0,C,2039784.0,0.13,NaN,0.0,293.01,< 1 year,Fully Paid,RENT,0.0
40530,25000.0,36 months,19.79%,25000.0,F,1440000.0,3.26,NaN,1.0,987.45,10+ years,Does not meet the credit policy. Status:Fully ...,MORTGAGE,0.0

How does this work?

The filter creates a boolean series showing which row satisfies the filter condition and which row does not. The boolean series is then used to index the dataframe.

Let's create a filter for just grade "A".

In [130]:
grade_filter = raw_data.grade == 'A'
print(type(grade_filter))
print(grade_filter)

<class 'pandas.core.series.Series'>
0        False
1        False
2        False
3        False
4        False
         ...
42533    False
42534     True
42535     True
42536    False
42537    False
Name: grade, Length: 42538, dtype: bool

In [131]:
raw_data[grade_filter].head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,hardship_loan_status,delinq_2yrs,last_pymnt_amnt,emp_length,loan_status,home_ownership,tax_liens
5,5000.0,36 months,7.90%,5000.0,A,36000.00,11.20,NaN,0.0,161.03,3 years,Fully Paid,RENT,0.0
17,3600.0,36 months,6.03%,3600.0,A,110000.00,10.52,NaN,0.0,583.45,10+ years,Fully Paid,MORTGAGE,0.0
19,9200.0,36 months,6.03%,9200.0,A,77385.19,9.86,NaN,0.0,8061.10,6 years,Fully Paid,RENT,0.0
30,4375.0,36 months,7.51%,4375.0,A,17108.00,20.34,NaN,0.0,144.94,7 years,Fully Paid,MORTGAGE,0.0
31,31825.0,36 months,7.90%,31825.0,A,75000.00,14.03,NaN,0.0,16966.70,5 years,Fully Paid,MORTGAGE,0.0

## Missing Values
Most algorithms assume all values are available and can't handle missing data. The action to take for missing values depends on both the ratio of missing to total values and the field of application / variable meaning.

For fields with high missing rate: 
    - drop the field as it's probably useless with so many values missing
    
For fields with low missing rate we can have multiple approaches
    - drop rows with any empty value
    - impute missing values by
        - mean
        - mode
        - extreme values in case we need to be conservative (check the use case)
        - predict the missing values using the other fields

### Check missing values for this dataset for each field

Let's check Null values - missing data cells for individual loans. 
Are there any variables that we would discard?

In [132]:
raw_data.isnull().sum(axis=0)

loan_amnt                   3
term                        3
int_rate                    3
funded_amnt                 3
grade                       3
annual_inc                  7
dti                         3
hardship_loan_status    42538
delinq_2yrs                32
last_pymnt_amnt             3
emp_length               1115
loan_status                 3
home_ownership              3
tax_liens                 108
dtype: int64

### Remove hardship_loan_status from the dataframe
Hint: check out the .drop() command on a Pandas dataframe

Note that axis=0 means row indexes, so it is used when removing a row,<br/>
and axis=1 means column indexes, so it is used when removing a column

In [133]:
raw_data = raw_data.drop(['hardship_loan_status'], axis=1)

### Remove all rows with any missing values

In [134]:
raw_data = raw_data.dropna()

In [135]:
#Check null values again
raw_data.isnull().sum(axis=0)

loan_amnt          0
term               0
int_rate           0
funded_amnt        0
grade              0
annual_inc         0
dti                0
delinq_2yrs        0
last_pymnt_amnt    0
emp_length         0
loan_status        0
home_ownership     0
tax_liens          0
dtype: int64

## Duplication 

There could be multiple reasons for having multiple records for a loan
    - duplicate rows
    - loan history tracked over time

Our dataset is not a case of the latter, so if there were multiple records, it could only be due to duplication. In this case however, there is a unique record for each loan,
so we don't have to worry about this step in our case.

To remove duplicates, check out the drop_duplicates() method
## Transforming and cleaning individual columns

### Creating a new binary numerical column for prediction
We will predict loan defaults in the second lecture. We will need a two-value variable, denoting whether the specific loan was paid off or defaulted. Moreover, the algorithms we will use can work with numerical columns. Our best bet it to represent the two values in a 1-0 column. Let's use the "`loan_status`" column.

In [136]:
raw_data.loan_status.value_counts()

loan_status
Fully Paid                                             33230
Charged Off                                             5439
Does not meet the credit policy. Status:Fully Paid      1913
Does not meet the credit policy. Status:Charged Off      736
Name: count, dtype: int64

Let's keep only the loans with `Fully Paid` and `Charged Off` status as the other ones are special cases and are not of our interest for this analysis.
To achieve this, let's filter the data to only include loans with by these two statuses.

In [137]:
raw_data = raw_data[(raw_data['loan_status'] == 'Fully Paid') | (raw_data['loan_status'] == 'Charged Off')]

In [138]:
raw_data.loan_status.value_counts()

loan_status
Fully Paid     33230
Charged Off     5439
Name: count, dtype: int64

**Map categorial values to a newly created 1-0 column**

In [139]:
#Let's check the first 10 loans
raw_data.loan_status[:10]

0     Fully Paid
1    Charged Off
2     Fully Paid
3     Fully Paid
4     Fully Paid
5     Fully Paid
6     Fully Paid
7     Fully Paid
8    Charged Off
9    Charged Off
Name: loan_status, dtype: object

We can create a dictionary and use it for translation.

In [140]:
#Create a dictionary to use for translation
def_map = {'Fully Paid': 0, 'Charged Off': 1}
def_map

{'Fully Paid': 0, 'Charged Off': 1}

We can use the `.map()` command to apply a function or a mapping dictionary on each row of the dataframe.

In [141]:
#Check how mapping the values works
raw_data.loan_status.map(def_map)[:10]

0    0
1    1
2    0
3    0
4    0
5    0
6    0
7    0
8    1
9    1
Name: loan_status, dtype: int64

In [142]:
#Create the new column
raw_data['defaulted'] = raw_data.loan_status.map(def_map)

Let's remove the original `loan_status` column

In [143]:
raw_data = raw_data.drop('loan_status', axis=1)
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,delinq_2yrs,last_pymnt_amnt,emp_length,home_ownership,tax_liens,defaulted
0,5000.0,36 months,10.65%,5000.0,B,24000.0,27.65,0.0,171.62,10+ years,RENT,0.0,0
1,2500.0,60 months,15.27%,2500.0,C,30000.0,1.00,0.0,119.66,< 1 year,RENT,0.0,1
2,2400.0,36 months,15.96%,2400.0,C,12252.0,8.72,0.0,649.91,10+ years,RENT,0.0,0
3,10000.0,36 months,13.49%,10000.0,C,49200.0,20.00,0.0,357.48,10+ years,RENT,0.0,0
4,3000.0,60 months,12.69%,3000.0,B,80000.0,17.94,0.0,67.30,1 year,RENT,0.0,0

### Creating a numerical variable from `emp_length`
Let's continue the preparation for the next lecture. We still have categorical variables we believe could be meaningful for predicting default. As stated earlier, the algorithms work with numerical columns, so let's represent this information in numerical columns.

In [144]:
raw_data.emp_length.unique()

array(['10+ years', '< 1 year', '1 year', '3 years', '8 years', '9 years',
       '4 years', '5 years', '6 years', '2 years', '7 years'],
      dtype=object)

In [145]:
emp_map1 = {}
for i in range (2,10):
    key = str(i) + ' years'
    value = i
    emp_map1[key] = value

In [146]:
emp_map = {str(i) + ' years' : i for i in range(2,10)}
emp_map

{'2 years': 2,
 '3 years': 3,
 '4 years': 4,
 '5 years': 5,
 '6 years': 6,
 '7 years': 7,
 '8 years': 8,
 '9 years': 9}

In [147]:
emp_map['< 1 year'] = 0
emp_map['n/a'] = 0
emp_map['10+ years'] = 10
emp_map['1 year'] = 1
emp_map

{'2 years': 2,
 '3 years': 3,
 '4 years': 4,
 '5 years': 5,
 '6 years': 6,
 '7 years': 7,
 '8 years': 8,
 '9 years': 9,
 '< 1 year': 0,
 'n/a': 0,
 '10+ years': 10,
 '1 year': 1}

In [148]:
raw_data.emp_length[:10]

0    10+ years
1     < 1 year
2    10+ years
3    10+ years
4       1 year
5      3 years
6      8 years
7      9 years
8      4 years
9     < 1 year
Name: emp_length, dtype: object

In [149]:
raw_data.emp_length.map(emp_map)[:10]

0    10
1     0
2    10
3    10
4     1
5     3
6     8
7     9
8     4
9     0
Name: emp_length, dtype: int64

In [150]:
#Overwrite the column
raw_data.emp_length = raw_data.emp_length.map(emp_map)
raw_data.emp_length.unique()

array([10,  0,  1,  3,  8,  9,  4,  5,  6,  2,  7])

In [151]:
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,delinq_2yrs,last_pymnt_amnt,emp_length,home_ownership,tax_liens,defaulted
0,5000.0,36 months,10.65%,5000.0,B,24000.0,27.65,0.0,171.62,10,RENT,0.0,0
1,2500.0,60 months,15.27%,2500.0,C,30000.0,1.00,0.0,119.66,0,RENT,0.0,1
2,2400.0,36 months,15.96%,2400.0,C,12252.0,8.72,0.0,649.91,10,RENT,0.0,0
3,10000.0,36 months,13.49%,10000.0,C,49200.0,20.00,0.0,357.48,10,RENT,0.0,0
4,3000.0,60 months,12.69%,3000.0,B,80000.0,17.94,0.0,67.30,1,RENT,0.0,0

### Exercise: Create a numerical variable from `grade`
Let's do the same process for `grade`. Here we can use the ordinal nature of the grades to create a numerical column.

In [152]:
#Check unique values
raw_data.grade.unique()

array(['B', 'C', 'A', 'E', 'F', 'D', 'G'], dtype=object)

In [153]:
#Create a dictionary to use for translation
grade_map = {'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6, 'G': 7}
grade_map

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6, 'G': 7}

In [154]:
#Check first 10 elements of column `grade`
raw_data.grade[:10]

0    B
1    C
2    C
3    C
4    B
5    A
6    C
7    E
8    F
9    B
Name: grade, dtype: object

In [155]:
#Overwrite the column, use the `map` function
raw_data.grade = raw_data.grade.map(grade_map)

In [156]:
#Check the first few rows of the dataframe
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,delinq_2yrs,last_pymnt_amnt,emp_length,home_ownership,tax_liens,defaulted
0,5000.0,36 months,10.65%,5000.0,2,24000.0,27.65,0.0,171.62,10,RENT,0.0,0
1,2500.0,60 months,15.27%,2500.0,3,30000.0,1.00,0.0,119.66,0,RENT,0.0,1
2,2400.0,36 months,15.96%,2400.0,3,12252.0,8.72,0.0,649.91,10,RENT,0.0,0
3,10000.0,36 months,13.49%,10000.0,3,49200.0,20.00,0.0,357.48,10,RENT,0.0,0
4,3000.0,60 months,12.69%,3000.0,2,80000.0,17.94,0.0,67.30,1,RENT,0.0,0

### Creating a numerical variable from `term`
Let's check the unique values of the term column and extract the number values.

In [157]:
raw_data.term.unique()

array([' 36 months', ' 60 months'], dtype=object)

As the numerical values are always contained in the 2nd and the 3rd character of the string, we can simply extract that substring with the `slice()` indexing and convert it into integer type.

Fortunately there's a function in pandas called `pd.to_numeric()` that can convert numeric values stored as string to numeric types.

In [158]:
raw_data.term = pd.to_numeric(raw_data.term.str.slice(1,3))

Let's check the resulting data type

In [159]:
type(raw_data.term[0])

numpy.int64

In [160]:
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,delinq_2yrs,last_pymnt_amnt,emp_length,home_ownership,tax_liens,defaulted
0,5000.0,36,10.65%,5000.0,2,24000.0,27.65,0.0,171.62,10,RENT,0.0,0
1,2500.0,60,15.27%,2500.0,3,30000.0,1.00,0.0,119.66,0,RENT,0.0,1
2,2400.0,36,15.96%,2400.0,3,12252.0,8.72,0.0,649.91,10,RENT,0.0,0
3,10000.0,36,13.49%,10000.0,3,49200.0,20.00,0.0,357.48,10,RENT,0.0,0
4,3000.0,60,12.69%,3000.0,2,80000.0,17.94,0.0,67.30,1,RENT,0.0,0

### Creating a numerical variable from `int_rate`
The column `int_rate` looks fine from just looking at the table, but let's see what type of values does it contain.

In [161]:
print(type(raw_data.int_rate[0]))
raw_data.int_rate[0]

<class 'str'>

' 10.65%'

Spoiler: the `pd.to_numeric()` it will not work here, guess why...

In [162]:
raw_data.int_rate = pd.to_numeric(raw_data.int_rate.map(lambda s: s.replace('%', '')))

In [163]:
raw_data.int_rate[:3]

0    10.65
1    15.27
2    15.96
Name: int_rate, dtype: float64

In [164]:
raw_data.head()

,loan_amnt,term,int_rate,funded_amnt,grade,annual_inc,dti,delinq_2yrs,last_pymnt_amnt,emp_length,home_ownership,tax_liens,defaulted
0,5000.0,36,10.65,5000.0,2,24000.0,27.65,0.0,171.62,10,RENT,0.0,0
1,2500.0,60,15.27,2500.0,3,30000.0,1.00,0.0,119.66,0,RENT,0.0,1
2,2400.0,36,15.96,2400.0,3,12252.0,8.72,0.0,649.91,10,RENT,0.0,0
3,10000.0,36,13.49,10000.0,3,49200.0,20.00,0.0,357.48,10,RENT,0.0,0
4,3000.0,60,12.69,3000.0,2,80000.0,17.94,0.0,67.30,1,RENT,0.0,0

In [165]:
raw_data.to_pickle('Lendmark_clean.pkl')

In [166]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38669 entries, 0 to 39753
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   loan_amnt        38669 non-null  float64
 1   term             38669 non-null  int64
 2   int_rate         38669 non-null  float64
 3   funded_amnt      38669 non-null  float64
 4   grade            38669 non-null  int64
 5   annual_inc       38669 non-null  float64
 6   dti              38669 non-null  float64
 7   delinq_2yrs      38669 non-null  float64
 8   last_pymnt_amnt  38669 non-null  float64
 9   emp_length       38669 non-null  int64
 10  home_ownership   38669 non-null  object
 11  tax_liens        38669 non-null  float64
 12  defaulted        38669 non-null  int64
dtypes: float64(8), int64(4), object(1)
memory usage: 5.1+ MB